Text["ar"] = {
	title = "!سنة صينية جديدة سعيدة",
	items = {
		desc = "المواد",
		rope = "حبل",
		wood = "خشب",
		scissors = "مقص",
		glue = "غراء",
		paper = "ورقة",
		paint = "طلاء",
		paint_brush = "فرشاة الرسم",
		lamp = "مصباح",
		lamp_final = "المصباح النهائي"
	},
	tips = {
		materials = {
			".يمكن العثور على الورق والحبال والخشب بالقرب من الأشجار",
			".المقص والغراء موجودان في القرية",
			".توجد علب الطلاء بالقرب من الماء أو المصابيح",
			".فرشاة الطلاء مرواغة. يمكن أن تكون في أي مكان. اقفز فوق الخريطة للعثور عليها"
		}
	},
	craft = {
		instruct = "انقر فوق العناصر لسحبها بين المخزون الخاص بك وطاولة التصنيع",
		lamp = "اصنع المصباح"
	},
	install = "!اذهب إلى القرية وقم بتثبيت المصباح الذي انتهيت منه للتو",
	draw = {
		instruct = {
			"!ارسم الكلمة الصينية فوق المصباح",
			"!انقر فوق الشاشة لبدء رسم خط. لكل نقطة ، انقر مرة أخرى",
			".يمكنك إنها الخط بالضغط على مفتاح مسافة",
			".'عندما يكون الرسم جاهزًا ، يمكنك النقر فوق الزر 'إنهاء الرسم",
			"!إذا قمت برسم الكلمة بشكل صحيح ، فستحصل على مصباح جاهز لتعلقه في القرية"
		},
		lamp = "ارسم على المصباح",
		finish = "إنهاء الرسم",
		undo = "تراجع عن الرسم",
		isbad = ".لم ترسم الكلمة بشكل صحيح. حاول مرة أخري",
		isgood = "!رسم ممتاز"
	},
	truffle = {
		welcome = {
			"!مرحبًا بكم في عيد رأس السنة الصينية! أحتاج إلى مساعدتكم لتزيين القرية بشكل مناسب للمهرجان",
			"!نحن بحاجة إلى صنع مجموعة من المصابيح! ابحث في جميع أنحاء القرية للعثور على المواد التي نحتاجها",
		},
		thanks = {".شكرا جزيلا لك! لم أستطع فعل هذا بدونك! يمكنك الاستمتاع بالمهرجان"}
	},
	han = {
		[1] = {
			name = "أرنب",
			desc = {"!هذه هي سنة الأرنب ، سنتي! أنا متحمس جدا بشأن هذا"}
		},
		[2] = {
			name = "الأبراج الصينية",
			desc = {"!تتخصص الأبراج الصينية بالحيوانات وصفاتها كل عام في دورة مدتها اثني عشر عامًا"}
		},
		[3] = {
			name = "مفرقعات نارية",
			desc = {"!المفرقعات النارية صاخبة للغاية ولديها فتيل قصير جدًا! لن أجعلهم غاضبين لو كنت مكانك"}
		},
		[4] = {
			name = "العاب ناريه",
			desc = {"!عندما تنطلق الألعاب النارية ، توجد أضواء جميلة في السماء بجميع أنواع الأشكال المختلفة"}
		},
		[5] = {
			name = "بدلة التانغ",
			desc = {"!بدلة التانغ تجلب الحظ السعيد وأطيب التمنيات! إنها تمثل السعادة وطول العمر"}
		},
		[6] = {
			name = "رقصة الأسد",
			desc = {"!عادة ما يتم أداء رقصة الأسد خلال العام الجديد لجلب الحظ السعيد وطرد الأرواح الشريرة"}
		},
		[7] = {
			name = "مهرجان الربيع",
			desc = {"!!!مهرجان الربيع هو أكبر احتفال في كل الصين! يستمر الاحتفال به لمدة خمسة عشر يومًا كاملاً! أنا متحمس جدا"}
		},
		[8] = {
			name = "الفانوس",
			desc = {"!تضيء الفوانيس في الليل. إنهم يجلبون الحظ الجيد ويساعدونك على المضي قدمًا"}
		},
		[9] = {
			name = "أرنب اليشم",
			desc = {"!أرنب اليشم وصل إلى القمر! لا يهم أين أنت ، إذا نظرت إليه ، سيساعدك على تذكر أخلاقيات البر والتضحية بالنفس"}
		},
		[10] = {
			name = "المقاطع الشعرية",
			desc = {"المقاطع الشعرية عبارة عن سطرين شعريين متكاملين يلتزمان بقواعد معينة. غالبًا ما يتم كتابته على ورق أحمر أو منحوتة على قوائم خشبية لتقديرها"}
		},
		[11] = {
			name = "مباركة",
			desc = {"البركة هي فعل كلام من يبارك"}
		},
		[12] = {
			name = "البرتقال واليوسفي",
			desc = {"!البرتقال واليوسفي فواكه لذيذة ومغذية. كلاهما برتقالي وله رائحة فريدة ومميزة للغاية"}
		},
		[13] = {
			name = "الزلابية",
			desc = {"!الزلابية مصنوعه من العجين. يمكن ملؤها بجميع أنواع الأطعمة اللذيذة"}
		},
		[14] = {
			name = "سبائك",
			desc = {"!السبائك عبارة عن مواد مصبوبة في شكل لتسهيل النقل والمعالجة. إنها تجعل المعدن سهل النقل والتخزين والقياس"}
		},
		[15] = {
			name = "المباركة للسنة الجديدة",
			desc = {"!هذا يمثل 'المباركة للسنة الجديدة'. أود أن أتمنى لك سنة جديدة رائعة! أتمنى أن تجعلك الأرانب سعيدة"}
		},
		[16] = {
			name = "ليلة رأس السنة القمرية الجديدة",
			desc = {"!ليلة رأس السنة القمرية هي أهم أمسية في السنة !!! الجميع يتحمس عندما تأتي"}
		},
		[17] = {
			name = "ألاحتفال بالأسلاف",
			desc = {"!الاحتفال الأسلاف هي فعل الاحتفال بأولئك الذين لم يعودوا معنا. كثير من الناس  يكرمون من ماتوا"}
		},
		[18] = {
			name = "قص الورق للإصبع",
			desc = {"!قص الورق للإصبع هو ألم كبير! لا يحدث ذلك كثيرًا ، ولكن عندما يحدث ، ستشعر به"}
		},
		[19] = {
			name = "الأبراج الفلكية",
			desc = {"!الأبراج تتغير كل عام. هم حيوانات مختلفة كل عام! تتكرر الأبراج كل 12 عامًا ، لكنها تغير عنصرها كل عام أيضًا"}
		},
		[20] = {
			name = "وعاء ساخن",
			desc = {"!تساعد الأواني الساخنة على طهي الطعام اللذيذ الذي ستأكله جميعًا خلال وليمة العشاء"}
		},
		[21] = {
			name = "تنين",
			desc = {"!التنانين رائعة جدا! لقد كانوا في كل حكاية خرافية يمكنك تخيلها! لسوء الحظ ، يلعبون دور السيئ في معظم الأوقات ، لكنهم جيدون حقًا ، أعدك"}
		},
		[22] = {
			name = "مهرجان الفوانيس",
			desc = {"!مهرجان الفوانيس رائع للغاية! آلاف الفوانيس تضيء السماء ليلاً ، وتساعدنا على تجاوز الماضي والتركيز على الحاضر والمستقبل"}
		},
		[23] = {
			name = "الموسم",
			desc = {"!يمكن أن تكون الفصول حارة  ويمكن أن تكون باردة ، ويمكن أن تكون ممتعة  وتبرز الحساسية لديك! يتغيرون كثيرًا لدرجة أنهم في بعض الأحيان ينسون ما يفترض أن يكونوا في وقتهم"}
		},
		[24] = {
			name = "المهرجان",
			desc = {"!أحب عندما تقام المهرجانات! يحب الناس المهرجانات! وهم يحبون الاحتفال! عندما يأتون ، يصبح الجميع متحمسين وسعداء للغاية"}
		},
	}
}