Text["cn"] = {
	title = "春节快乐!",
	items = {
		desc = "材料",
		rope = "绳子",
		wood = "木头",
		scissors = "剪刀",
		glue = "胶水",
		paper = "纸",
		paint = "漆",
		paint_brush = "漆刷",
		lamp = "灯笼",
		lamp_final = "已经完成的灯笼"
	},
	tips = {
		materials = {
			"纸，绳子和木头可以在树边找到.",
			"剪刀和教学一般可以在村庄里找到.",
			"漆一般可以在水边或者灯笼的旁边找到.",
			"漆刷被藏起来了,可能在任何地方.跨越整个地图去寻找它吧!"
		}
	},
	craft = {
		instruct = "点击物品并用鼠标在你的库存和工作台之间拖动.",
		lamp = "制造灯笼"
		
	},
	install = "跨越村庄,安装你刚刚完成的灯笼!",
	draw = {
		instruct = {
			"在灯笼上写下汉字 !",
			"依次在屏幕上点击两个点来画一条线段!",
			"按空格键来完成一条线段的绘制.",
			"绘制完成时，点击'完成绘制' 选项.",
			"如果你正确地绘制文字,你就可以将你准备的灯笼安装在村庄之中!"
		},
		lamp = "在灯笼上绘制",
		finish = "完成绘制",
		undo = "撤回笔划",
		isbad = "你没有正确绘制文字,再试一次吧!.",
		isgood = "完美的作品!"
	},
	truffle = {
		welcome = {
			"嗨!! 欢迎来到中国春节! 我需要你的帮助来正确地装饰村庄以迎接节日!",
			"我们需要制作一串灯笼!在村庄里面寻找我们需要的材料!",
		},
		thanks = {"非常感谢你! 没有你我无法完成这些! 节日快乐:D"}
	},
	han = {
		[1] = {
			name = "兔兔",
			desc = {"今年是兔年, 是我的年哦! 我好激动!"}
		},
		[2] = {
			name = "生肖",
			desc = {"生肖以十二年为周期,每一年都对应一种动物和它们的属相!"}
		},
		[3] = {
			name = "鞭炮",
			desc = {"鞭炮的声音超级大,而且它们的引线非常短!如果我是你,就不会引爆它们!"}
		},
		[4] = {
			name = "烟花",
			desc = {"当烟花爆炸时,天空中会出现各种不同形状的美丽火花!"}
		},
		[5] = {
			name = "唐装",
			desc = {"唐装带来好运和美好的祝愿! 它代表着幸福和吉祥!"}
		},
		[6] = {
			name = "舞狮",
			desc = {"舞狮通常在新年期间进行以带来好运和驱除邪灵。!"}
		},
		[7] = {
			name = "春节",
			desc = {"春节是全中国最大的庆祝活动! 它的庆祝活动将持续了整整15天!我好兴奋!!!"}
		},
		[8] = {
			name = "灯笼",
			desc = {"灯笼照亮了夜晚。他们带来好运,并引领你走向新的未来!"}
		},
		[9] = {
			name = "玉兔",
			desc = {"玉兔一路飞向了月球! 遥望夜空，你就可以在月亮上看到它的轮廓."}
		},
		[10] = {
			name = "对联",
			desc = {"对联是遵守一定规则的两句互补的诗句。它通常被写在红纸上或刻在木质的立柱上,用于欣赏!"}
		},
		[11] = {
			name = "祝福",
			desc = {"祝福是人们相互传达的新年愿望和对未来的美好祝愿!"}
		},
		[12] = {
			name = "橙子和橘子",
			desc = {"橙子和橘子是美味和富有营养的水果。它们都是橙色的,有一种非常独特、鲜明的气味!"}
		},
		[13] = {
			name = "饺子",
			desc = {"饺子由面团制成. 你可以加入很多种类的美味馅料!"}
		},
		[14] = {
			name = "元宝",
			desc = {"元宝是一种古代的货币,有着金属锭的形状,象征着财富!"}
		},
		[15] = {
			name = "拜年",
			desc = {"这代表\"拜年\". 我祝愿你有一个美好的新年!我希望兔子们能让你快乐!"}
		},
		[16] = {
			name = "除夕",
			desc = {"除夕夜是一年中最重要的夜晚,每个人都在那个时候兴奋地庆祝新年的到来!"}
		},
		[17] = {
			name = "祭祖",
			desc = {"祭祖是一种纪念祖先的活动。许多人在家里建立神龛,提供贡品来祭拜以纪念那些已经去世的人."}
		},
		[18] = {
			name = "剪纸",
			desc = {"剪纸很痛苦,我不经常制作它,但是制作它的时候就知道有多困难了!"}
		},
		[19] = {
			name = "生肖",
			desc = {"生肖每年都在变化。他们每年都是不同的动物,每12年重复一次!"}
		},
		[20] = {
			name = "火锅",
			desc = {"在年夜饭中,人们可以在火锅中加入自己喜爱的食材!"}
		},
		[21] = {
			name = "龙",
			desc = {"龙非常酷炫! 它们出现在非常多的童话故事中! 不幸的是,大多数时候它们扮演的是反派角色,但它们在这儿是好的，我保证!"}
		},
		[22] = {
			name = "元宵节",
			desc = {"元宵节绝对是华丽的! 成千上万的灯笼照亮了夜空,帮助我们从过去走出来,走向现在和未来!"}
		},
		[23] = {
			name = "季节",
			desc = {"季节可以是炎热的,可以是寒冷的,可以是愉快的,也可以是带来过敏的! 季节变化如此频繁，以至于季节们有时会忘记在自己的季节应该是怎么样的!"}
		},
		[24] = {
			name = "节日",
			desc = {"我喜欢节日的到来! 人们喜欢节日! 他们也喜欢庆祝! 每当节日到来时,每个人都会变得如此兴奋,如此快乐!"}
		},
	}
}